app/views/interest_points/_form.html.erb

SELECT "categories".* FROM "categories"
---
          <td><%= f.label :category_id %></td>
          <td><%= f.select :category_id, options_for_select(Category.all.collect{ |u| [u.name, u.id] }), { }, { class: 'form-control' } %></td>