app/controllers/admin/images_controller.rb

	def index
		@images = Image.pending
		#@images = InterestPoint.joins(:images).where(images: { approver_id: nil }).uniq.all
		@interest_points = InterestPoint.all
---
SELECT "interest_points".* FROM "interest_points"

	def approve
		if @image.update({approver_id: current_user.id, approved_at: DateTime.now})
---
UPDATE "images" SET "approver_id" = ?, "approved_at" = ?, "updated_at" = ? WHERE "images"."id" = 1  [["approver_id", 1], ["approved_at", Thu, 03 Apr 2014 23:41:31 UTC +00:00], ["updated_at", Thu, 03 Apr 2014 23:41:31 UTC +00:00]]

	def unapprove
		if @image.update({approver_id: nil, approved_at: nil})
---
UPDATE "images" SET "approver_id" = ?, "approved_at" = ?, "updated_at" = ? WHERE "images"."id" = 6  [["approver_id", nil], ["approved_at", nil], ["updated_at", Thu, 03 Apr 2014 23:41:26 UTC +00:00]]