app/controllers/admin/interest_points_controller.rb

SELECT "interest_points".* FROM "interest_points"
---
	def index
		@interest_points = InterestPoint.all