app/views/users/_form.html.erb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = 'Guest' LIMIT 1
---
				<%= f.label :role_id, class: "form-label" %><br />
				<%= f.select :role_id, options_from_collection_for_select(Role.all, :id, :name, @user.role_id), class: "form-control" %>