app/controllers/artists_controller.rb

  def show
  	@artist = Artist.find(params[:id])
    @artist_interest_points = InterestPoint.joins(:artist_interest_points).where('artist_interest_points.artist_id = ?', @artist.id).uniq
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", "1"]]
SELECT DISTINCT "interest_points".* FROM "interest_points" INNER JOIN "artist_interest_points" ON "artist_interest_points"."interest_point_id" = "interest_points"."id" WHERE (artist_interest_points.artist_id = 1)

  def create
    @artist = Artist.new(artist_params)
    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 05 Apr 2014 17:27:34 UTC +00:00], ["first_name", "first name"], ["last_name", "last name"], ["updated_at", Sat, 05 Apr 2014 17:27:34 UTC +00:00]]

  def update
    respond_to do |format|
      if @artist.update(artist_params)
---
UPDATE "artists" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "artists"."id" = 1  [["first_name", "bob"], ["last_name", "villa"], ["updated_at", Sat, 05 Apr 2014 17:36:31 UTC +00:00]]