app/controllers/categories_controller.rb

	def create
		if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 04 Mar 2014 19:30:52 UTC +00:00], ["name", "Test Category"], ["updated_at", Tue, 04 Mar 2014 19:30:52 UTC +00:00]]