app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	@comment.commentable = @commentable
  	if @comment.save