app/controllers/interest_points_controller.rb

INSERT INTO "interest_points" ("address_line_1", "category_id", "city", "contributor_id", "created_at", "latitude", "longitude", "name", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		## You can't call @interest_point.id here because it doesn't have one yet; this needs to be moved out
    # if current_user
      # @rating = Rating.create(interest_point_id: @interest_point.id, user_id: @current_user.id, score: 0)
    # end
		if @interest_point.save

DELETE FROM "interest_points" WHERE "interest_points"."id" = ?  [["id", 1]]
---
	def destroy
		@interest_point.destroy

UPDATE "interest_points" SET "name" = ?, "latitude" = ?, "longitude" = ?, "address_line_1" = ?, "updated_at" = ? WHERE "interest_points"."id" = 1  [["name", "Updated Interest Point"], ["latitude", 33.580178], ["longitude", -85.076221], ["address_line_1", "200-298 Alabama Street"], ["updated_at", Tue, 04 Mar 2014 19:30:57 UTC +00:00]]
---
	def update
		store_location
		set_default_image if @interest_point.default_image.nil?
		@interest_point.approver = nil
		@interest_point.approved_at = nil
		if @interest_point.update(interest_point_params)

SELECT "images".* FROM "images" WHERE "images"."interest_point_id" = ?  [["interest_point_id", 1]]
---
	def set_default_image
		@interest_point.default_image_id = @interest_point.images.first.id unless @interest_point.images.empty?