app/controllers/maps_controller.rb

SELECT "categories".* FROM "categories"
SELECT "images".* FROM "images" WHERE "images"."interest_point_id" = ? ORDER BY "images"."id" ASC LIMIT 1  [["interest_point_id", 1]]
---
  def main
    @interest_points = InterestPoint.active
    @categories = Category.all
    @hash = Gmaps4rails.build_markers(@interest_points) do |interest_point, marker|
      marker.lat interest_point.latitude
      marker.lng interest_point.longitude
      lat = "#{interest_point.latitude}"
      long = "#{interest_point.longitude}"
      image = "#{interest_point.images.first.file_url}"

SELECT "interest_points".* FROM "interest_points" WHERE (category_id LIKE '%1%')
SELECT "categories".* FROM "categories"
SELECT "images".* FROM "images" WHERE "images"."interest_point_id" = ? ORDER BY "images"."id" ASC LIMIT 1  [["interest_point_id", 1]]
---
  def show
    @interest_points = InterestPoint.where("category_id LIKE ?", "%#{params[:id]}%")
    @categories = Category.all
    @hash = Gmaps4rails.build_markers(@interest_points) do |interest_point, marker|
      marker.lat interest_point.latitude
      marker.lng interest_point.longitude
      lat = "#{interest_point.latitude}"
      long = "#{interest_point.longitude}"
      image = "#{interest_point.images.first.file_url}"