app/controllers/ratings_controller.rb

UPDATE "ratings" SET "score" = ?, "updated_at" = ? WHERE "ratings"."id" = 1  [["score", 0], ["updated_at", Thu, 03 Apr 2014 23:25:26 UTC +00:00]]
---
  def update
		p "UPDATE rating"
    if current_user.nil?
			flash.now[:error] = 'You must be signed in to specify a rating.'
    else
			@rating.ratable = @ratable
			@rating.user = current_user
	    if @rating.update_attributes(score: params[:score])