app/controllers/reset_passwords_controller.rb

UPDATE "users" SET "password_salt" = ?, "password_hash" = ?, "persistence_token" = ?, "perishable_token" = ?, "updated_at" = ? WHERE "users"."id" = 83
---
	def update
		@user.password = params[:password]
		@user.password_confirmation = params[:password_confirmation]
		if @user.save

SELECT "users".* FROM "users" WHERE (perishable_token = 'UKe9R0kWUsgxZCasqWWk' and updated_at > '2014-04-05 01:52:58.323359') ORDER BY "users"."id" ASC LIMIT 1
---
	def load_user_using_perishable_token
		@user = User.find_using_perishable_token(params[:id])