app/controllers/roles_controller.rb

  	def create
    	#@role = Role.new(role_params)
	    if @role.save
---
INSERT INTO "roles" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 04 Mar 2014 19:31:00 UTC +00:00], ["name", "Administrator"], ["updated_at", Tue, 04 Mar 2014 19:31:00 UTC +00:00]]

  	def update
			#@role = Role.find(params[:id])
    	if @role.update(role_params)
---
UPDATE "roles" SET "name" = ?, "updated_at" = ? WHERE "roles"."id" = 2  [["name", "Updated Role"], ["updated_at", Tue, 04 Mar 2014 19:31:00 UTC +00:00]]

  	def destroy
			#@role = Role.find(params[:id])
			@role.destroy
---
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 2]]