app/controllers/user_sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_name" = 'joshhessel' LIMIT 1
---
	def create
		## Check if the +User+ attempted to sign in with social media and use the appropriate method to create the +User Session+
		if env["omniauth.auth"]
			user = User.from_omniauth(env["omniauth.auth"])
			if user.valid?
				session[:user_id] = user.id
			end
		else
			user = User.find_by(user_name: params[:user][:user_name])