app/controllers/users_controller.rb

	def create
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_hash", "password_salt", "perishable_token", "persistence_token", "role_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def destroy
		if @user == current_user
			session[:user_id] = nil
			@current_ability = nil
		end
		@user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

	def update
		if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "perishable_token" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["first_name", "Updated Name"], ["perishable_token", "VmpoJtSHZORPNSXC2wR5"], ["updated_at", Tue, 04 Mar 2014 19:31:03 UTC +00:00]]