app/views/admin/images/index.html.erb

    <h3><%= interest_point.name %></h3>
    <% interest_point.images.each do |image| %>
---
SELECT "images".* FROM "images" WHERE "images"."interest_point_id" = ?  [["interest_point_id", 1]]