app/views/admin/interest_points/_images_list.html.erb

SELECT "images".* FROM "images" WHERE "images"."interest_point_id" = ?  [["interest_point_id", 1]]
---
<div id='images-list'>
  <% @interest_point.images.each do |image| %>