app/views/images/_carousel.html.erb

	<div id="slider">
		<% @interest_point.images.each do |image| %>
---
SELECT "images".* FROM "images" WHERE "images"."interest_point_id" = ?  [["interest_point_id", 1]]